Конфигурация/InformationRegisters/ПолномочияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ПолномочияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтейнерПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Полномочия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиГруппДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ПользователиВКонтейнерах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ПользователиВКонтейнерах</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Контейнер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтейнерПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ПраваРолей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ПраваРолей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Добавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧтениеБезОграничения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДобавлениеБезОграничения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзменениеБезОграничения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалениеБезОграничения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтерактивноеДобавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Редактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/ПрофилиГруппДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>ПрофилиГруппДоступа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоставляемыхДанных</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставляемыйПрофильИзменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьРоль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предустановленный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступРазрешен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Назначение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипПользователей</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/ПолномочияПользователей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьПолномочия(Владелец, Полномочия) Экспорт
	
	НачатьТранзакцию();
	
	// Сохранение информации о правах ролей до внесения изменений.
	ПользователиДляПроверкиПрав = РегистрыСведений.ПользователиВКонтейнерах.ПользователиВКонтейнере(Владелец);
	ПраваДоИзменений = ПраваПоПолномочиям(ПользователиДляПроверкиПрав);
	
	// Добавление Полномочий.
	Запись = РегистрыСведений.ПолномочияПользователей.СоздатьМенеджерЗаписи();
	Запись.Владелец = Владелец;
	Запись.Полномочия = Полномочия;
	Запись.Записать();
	
	// Обновление прав доступа.
	СравнитьПраваРолейИВыполнитьПересчетПрав(ПользователиДляПроверкиПрав, ПраваДоИзменений);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура УдалитьПолномочия(Владелец, Полномочия) Экспорт
	
	НачатьТранзакцию();
	
	// Сохранение информации о правах ролей до внесения изменений.
	ПользователиДляПроверкиПрав = РегистрыСведений.ПользователиВКонтейнерах.ПользователиВКонтейнере(Владелец);
	ПраваДоИзменений = ПраваПоПолномочиям(ПользователиДляПроверкиПрав);
	
	// Удаление полномочия для самого владельца.
	НаборЗаписей = РегистрыСведений.ПолномочияПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Полномочия.Установить(Полномочия);
	НаборЗаписей.Отбор.Владелец.Установить(Владелец);
	НаборЗаписей.Записать();
	
	// Обновление прав по дескрипторам.
	СравнитьПраваРолейИВыполнитьПересчетПрав(ПользователиДляПроверкиПрав, ПраваДоИзменений);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПраваПоПолномочиям(Пользователи)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПользователиВКонтейнерах.Пользователь КАК Пользователь,
		|	ПраваРолей.ОбъектМетаданных КАК ОбъектМетаданных,
		|	ИСТИНА КАК Чтение,
		|	ПраваРолей.Добавление КАК Добавление,
		|	ПраваРолей.Изменение КАК Изменение,
		|	ПраваРолей.ЧтениеБезОграничения КАК ЧтениеБезОграничения,
		|	ПраваРолей.ИзменениеБезОграничения КАК ИзменениеБезОграничения
		|ПОМЕСТИТЬ ПраваПользователей
		|ИЗ
		|	РегистрСведений.ПраваРолей КАК ПраваРолей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
		|		ПО ПраваРолей.Роль = ПрофилиГруппДоступаРоли.Роль
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПолномочияПользователей КАК ПолномочияПользователей
		|		ПО (ПрофилиГруппДоступаРоли.Ссылка = ПолномочияПользователей.Полномочия)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПользователиВКонтейнерах КАК ПользователиВКонтейнерах
		|		ПО (ПолномочияПользователей.Владелец = ПользователиВКонтейнерах.Контейнер)
		|ГДЕ
		|	ПользователиВКонтейнерах.Пользователь В(&Пользователи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ОбъектМетаданных КАК ОбъектМетаданных,
		|	МИНИМУМ(ВложенныйЗапрос.Чтение) КАК Чтение,
		|	МИНИМУМ(ВложенныйЗапрос.Добавление) КАК Добавление,
		|	МИНИМУМ(ВложенныйЗапрос.Изменение) КАК Изменение,
		|	МИНИМУМ(ВложенныйЗапрос.ЧтениеБезОграничения) КАК ЧтениеБезОграничения,
		|	МИНИМУМ(ВложенныйЗапрос.ИзменениеБезОграничения) КАК ИзменениеБезОграничения
		|ИЗ
		|	(ВЫБРАТЬ
		|		Пользователи.Ссылка КАК Пользователь,
		|		ИдентификаторыОбъектовМетаданных.Ссылка КАК ОбъектМетаданных,
		|		МАКСИМУМ(НЕ ПраваПользователей.ОбъектМетаданных ЕСТЬ NULL ) КАК Чтение,
		|		МАКСИМУМ(ЕСТЬNULL(ПраваПользователей.Добавление, ЛОЖЬ)) КАК Добавление,
		|		МАКСИМУМ(ЕСТЬNULL(ПраваПользователей.Изменение, ЛОЖЬ)) КАК Изменение,
		|		МАКСИМУМ(ЕСТЬNULL(ПраваПользователей.ЧтениеБезОграничения, ЛОЖЬ)) КАК ЧтениеБезОграничения,
		|		МАКСИМУМ(ЕСТЬNULL(ПраваПользователей.ИзменениеБезОграничения, ЛОЖЬ)) КАК ИзменениеБезОграничения
		|	ИЗ
		|		Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|			ПО (ИСТИНА)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПраваПользователей КАК ПраваПользователей
		|			ПО ИдентификаторыОбъектовМетаданных.Ссылка = ПраваПользователей.ОбъектМетаданных
		|				И (Пользователи.Ссылка = ПраваПользователей.Пользователь)
		|	ГДЕ
		|		ИдентификаторыОбъектовМетаданных.Ссылка В(&ОбъектыМетаданныхМеханизмаПрав)
		|		И Пользователи.Ссылка В(&Пользователи)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Пользователи.Ссылка,
		|		ИдентификаторыОбъектовМетаданных.Ссылка) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ОбъектМетаданных");
	
	Запрос.УстановитьПараметр("Пользователи", Пользователи);
	Запрос.УстановитьПараметр("ОбъектыМетаданныхМеханизмаПрав",
		ДокументооборотПраваДоступаПовтИсп.ВсеОбъектыМеханизмаПравДоступа());
	
	ТаблицаПрав = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПрав;
	
КонецФункции

Процедура СравнитьПраваРолейИВыполнитьПересчетПрав(Пользователи, СтарыеПрава);
	
	Если Не ДокументооборотПраваДоступаПовтИсп.ВключеноИспользованиеПравДоступа() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СтарыеПрава.ОбъектМетаданных,
		|	СтарыеПрава.Чтение,
		|	СтарыеПрава.Добавление,
		|	СтарыеПрава.Изменение,
		|	СтарыеПрава.ЧтениеБезОграничения,
		|	СтарыеПрава.ИзменениеБезОграничения
		|ПОМЕСТИТЬ СтарыеПрава
		|ИЗ
		|	&СтарыеПрава КАК СтарыеПрава
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НовыеПрава.ОбъектМетаданных,
		|	НовыеПрава.Чтение,
		|	НовыеПрава.Добавление,
		|	НовыеПрава.Изменение,
		|	НовыеПрава.ЧтениеБезОграничения,
		|	НовыеПрава.ИзменениеБезОграничения
		|ПОМЕСТИТЬ НовыеПрава
		|ИЗ
		|	&НовыеПрава КАК НовыеПрава
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НовыеПрава.ОбъектМетаданных КАК ОбъектМетаданных
		|ИЗ
		|	НовыеПрава КАК НовыеПрава
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтарыеПрава КАК СтарыеПрава
		|		ПО НовыеПрава.ОбъектМетаданных = СтарыеПрава.ОбъектМетаданных
		|			И НовыеПрава.Чтение = СтарыеПрава.Чтение
		|			И НовыеПрава.Добавление = СтарыеПрава.Добавление
		|			И НовыеПрава.Изменение = СтарыеПрава.Изменение
		|			И НовыеПрава.ЧтениеБезОграничения = СтарыеПрава.ЧтениеБезОграничения
		|			И НовыеПрава.ИзменениеБезОграничения = СтарыеПрава.ИзменениеБезОграничения
		|ГДЕ
		|	СтарыеПрава.ОбъектМетаданных ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("СтарыеПрава", СтарыеПрава);
	Запрос.УстановитьПараметр("НовыеПрава",  ПраваПоПолномочиям(Пользователи));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументооборотПраваДоступа.РассчитатьПраваОбъектовТаблицы(Выборка.ОбъектМетаданных);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
